I ran into a similar issue with the following resource:

```
resource "cloudflare_zero_trust_access_application" "test-application" {
  account_id = var.primary_account_id
  allowed_idps = []
  app_launcher_visible = true
  destinations = [{
    type = "public"
    uri = "test-application.${var.primary_zone_name}"
  }]
  domain = "test-application.${var.primary_zone_name}"
  http_only_cookie_attribute = true
  logo_url = "https://www.cloudflare.com/img/logo-web-badges/cf-logo-on-white-bg.svg"
  name = "Test Application"
  policies = [{
    # For some reason, passing id or id/precedence doesn't work and triggers {"code":12130,"message":"access.api.error.invalid_request: unrecognized policy decision"}
    # id = cloudflare_zero_trust_access_policy.test-policy.id
    # precedence = 1

    # Pull in policy info manually
    decision = cloudflare_zero_trust_access_policy.test-policy.decision
    exclude  = cloudflare_zero_trust_access_policy.test-policy.exclude
    include  = cloudflare_zero_trust_access_policy.test-policy.include
    name     = "${cloudflare_zero_trust_access_policy.test-policy.name} (Non-reusable)"
    require  = cloudflare_zero_trust_access_policy.test-policy.require

    # Attempted to add these to fix the resource update, didn't work:
    id = "00000000-1111-4222-3333-444444444444"
    precedence = 1
  }]
  type = "self_hosted"

  # Attempted to add these to fix the resource update, didn't work:
  options_preflight_bypass = false
  self_hosted_domains = ["test-application.${var.primary_zone_name}"]
  tags = []
}
```

There are two issues I ran into: first, I can't find a way to pass an existing policy ID to `policies`. And then, when passing a per-application policy, I get the update on every apply issue that @per-lind is running into.

Output:

```
# cloudflare_zero_trust_access_application.test-application will be updated in-place
~ resource "cloudflare_zero_trust_access_application" "test-application" {
    ~ aud                          = "000111222moremoremore" -> (known after apply)
    + cors_headers                 = (known after apply)
    ~ created_at                   = "2025-04-11T16:09:46Z" -> (known after apply)
    + footer_links                 = (known after apply)
      id                           = "00000000-1111-4222-3333-444444444444"
    + landing_page_design          = (known after apply)
      name                         = "Test Application"
    + path_cookie_attribute        = false
    ~ policies                     = [
        ~ {
            + connection_rules = (known after apply)
              id               = "00000000-1111-4222-3333-444444444444"
            ~ include          = [
                ~ {
                    + auth_context        = (known after apply)
                    + auth_method         = (known after apply)
                    + azure_ad            = (known after apply)
                    + common_name         = (known after apply)
                    + device_posture      = (known after apply)
                    + email_domain        = (known after apply)
                    + email_list          = (known after apply)
                    + external_evaluation = (known after apply)
                    + geo                 = (known after apply)
                    + github_organization = (known after apply)
                    + group               = (known after apply)
                    + gsuite              = (known after apply)
                    + ip                  = (known after apply)
                    + ip_list             = (known after apply)
                    + login_method        = (known after apply)
                    + okta                = (known after apply)
                    + saml                = (known after apply)
                    + service_token       = (known after apply)
                      # (1 unchanged attribute hidden)
                  },
                ~ {
                    + auth_context        = (known after apply)
                    + auth_method         = (known after apply)
                    + azure_ad            = (known after apply)
                    + common_name         = (known after apply)
                    + device_posture      = (known after apply)
                    + email_domain        = (known after apply)
                    + email_list          = (known after apply)
                    + external_evaluation = (known after apply)
                    + geo                 = (known after apply)
                    + github_organization = (known after apply)
                    + group               = (known after apply)
                    + gsuite              = (known after apply)
                    + ip                  = (known after apply)
                    + ip_list             = (known after apply)
                    + login_method        = (known after apply)
                    + okta                = (known after apply)
                    + saml                = (known after apply)
                    + service_token       = (known after apply)
                      # (1 unchanged attribute hidden)
                  },
              ]
              name             = "Test Policy (Non-reusable)"
              # (4 unchanged attributes hidden)
          },
      ]
    + saas_app                     = (known after apply)
    + scim_config                  = (known after apply)
    + skip_app_launcher_login_page = false
      tags                         = []
    + target_criteria              = (known after apply)
    ~ updated_at                   = "2025-04-11T16:09:46Z" -> (known after apply)
      # (13 unchanged attributes hidden)
  }
```

Some IDs/names updated to be more generic.